In [2]:
import pandas as pd

In [3]:
dept = pd.read_csv("departments.csv")
dept_emp = pd.read_csv("dept_emp.csv")
dept_man = pd.read_csv("dept_manager.csv")
emp = pd.read_csv("employees.csv")
sal = pd.read_csv("salaries.csv")
titles = pd.read_csv("titles.csv")

In [4]:
dept

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [28]:
dept_emp["emp_no"].value_counts()

448332    2
285806    2
49010     2
224392    2
44912     2
         ..
257752    1
237270    1
231125    1
233172    1
10245     1
Name: emp_no, Length: 300024, dtype: int64

In [6]:
dept_man.head()

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17
3    d002  110114  1989-12-17  9999-01-01
4    d003  110183  1985-01-01  1992-03-21

In [30]:
emp['emp_no'].value_counts()

10235     1
25177     1
35396     1
33349     1
39494     1
         ..
464200    1
466249    1
460106    1
462155    1
10245     1
Name: emp_no, Length: 300024, dtype: int64

In [10]:
sal.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [9]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01